
[
    {
        "teksti": "Päätös Suomen Egyptologisen Seuran perustamisessa tapahtui Kheopsin pyramidin juurella 10.4.1969 suomalaisseurueen Egyptiin suuntautuneella opintomatkalla. Matkan johtajana toimi edesmennyt professori (silloin FK) Rostislav Holthoer. Perustava kokous pidettiin jo 5.6.1969 ravintola Vaakunan kabinetissa. Tuolloin läsnä oli 27 henkeä ja päivää voidaan pitää seuran virallisena syntymäpäivänä. Holthoer valittiin luonnollisesti seuran puheenjohtajaksi ja tässä tehtävässä hän toimi kuolemaansa saakka 28.4.1997."
    },
    {
        "teksti": "Seuran tarkoituksena oli alusta alkaen luoda edellytyksiä egyptologian harrastamiselle ja tutkimukselle Suomessa sekä levittää alan tietoutta kaikille alasta kiinnostuneille. Lisäksi tavoitteena oli saada aikaan kirjasto ja julkaista egyptologisia tekstejä. Näitä toimintaperiaatteita seura alkoi noudattaa alusta asti. Heti ensimmäisen toimintavuoden aikana seuran jäsenet dokumentoivat ja luetteloivat valtion ja yksityisten suomalaisten egyptologiset kokoelmat.  Tämän työn tuloksena seura pystytti ensimmäisen näyttelynsä Helsingissä vuonna 1970, jossa oli esillä yli 700 esinettä. Tämän jälkeen seura on ollut mukana järjestämässä näyttelyjä eri puolella maata."
    },
    {
        "teksti": "Osittain näiden näyttelyiden ansiosta suomalaisten kiinnostus egyptologiaa kohtaan kasvoi, mikä näkyi Suomen Egyptologisen Seuran jäsenmäärässä miltei välittämästi. Heti 1970-luvun alussa jäsenmäärä nousi noin kahteensataan ja viidentoista toimintavuoden jälkeen jäseniä oli jo 500. Nykyään seuraan kuuluu noin 600 jäsentä."
    },
    {
        "teksti": "Seura on järjestänyt opintomatkoja Egyptiin 1970-luvulta lähtien. Seuran perustajan ja pitkäaikaisen puheenjohtajan professori Rostislav Holthoerin johdolla jäsenet suorittivat näillä matkoilla rajattuja kenttätutkimuksia. Seura on dokumentoinut mm. Speos Artemidos -temppelin koptilaiset seinämaalaukset, Tehna el-Gebelin roomalaisen temppelin jäännöksiä sekä Akhnatonin jo nyt tuhoutuneita piirtokirjoituksia el-Ashmuneinissa."
    },
    {
        "teksti": "Merkittävin dokumentointityö tehtiin Keski-Egyptissä sijaitsevan koptilaisen Deir Abu Hennisin eli Isä Johanneksen luostarin raunioilla vuonna 1978. Retkikunnan tehtävä oli taltioida kalkkikivilouhoksiin rakennetun koptilaisen erakkoyhdyskunnan kirkon tekstit ja seinämaalaukset sekä luetteloida ja tarkistaa lähiympäristön muistomerkit. Retkikunnan tieteelliset tulokset julkaistaan lähitulevaisuudessa Helsingin, Leidenin ja Brysselin yliopistojen välisenä yhteistyönä."
    },
    {
        "teksti": "Egyptiin suuntautuneiden matkojen lisäksi seura on järjestänyt opintomatkoja merkittäviin museoihin ja näyttelyihin ympäri Eurooppaa. Seuran jäsenet ovat saaneet tutustua mm. Tutankhamon-näyttelyyn silloisessa Leningradissa ja suureen Egyptin kielen sanakirjaprojektiin Berliinissä."
    },
    {
        "teksti": "Seura on alusta lähtien järjestänyt kuukausikokouksia, jossa on pidetty esitelmiä egyptologiaan kuuluvista tai siihen liittyvistä aiheista. Jo alkuvuosina Seura kutsui ulkomaisia asiantuntijoita esitelmöimään kokouksissa ja vuosien varrella on kuultu mm. nimekkäiden englantilaisten egyptologien Geoffrey T. Martinin (1978, 1993) ja John Bainesin (2000) mielenkiintoisia esitelmiä."
    },
    {
        "teksti": "Seuran perinteisiin kuuluu myös juhlia merkkivuosia. Seura järjesti 15-vuotisjuhlanäyttelyn \"Eläimet muinaisessa Egyptissä\" alkuvuonna 1985. Seuraava merkkivuosi vietettiin vuonna 1989, jolloin seuran 20-vuotista toimintaa juhlittiin mm. illallisella hotelli Intercontinentalissa ja runomatinealla Rikhardinkadun kirjastossa. Viisi vuotta myähemmin juhlittiin Tampereella tutustumalla näyttelyyn \"Muinainen Egypti - hetki ikuisuudesta\" ja illallisilla Finlaysonin palatsissa."
    },
    {
        "teksti": "Seuran perustaja ja itseoikeutettu puheenjohtaja Rostislav Holthoer kuoli 28.4.1997 vaikean sairauden jälkeen. Toimintaa päätettiin jatkaa varapuheenjohtajan Jaakko Frösénin johdolla, joka valittiin myös uudeksi puheenjohtajaksi seuraavassa vuosikokouksessa."
    },
    {
        "teksti": "30-vuotista taivalta juhlistettiin taas näyttelyllä. Tällä kertaa \"Niilin varrelta\" -niminen näyttely pystytettiin Helsingin yliopiston kirjastoon talvella 1999-2000. Samanniminen juhlakirja julkaistiin vuonna 2001. Juhlavuoden kunniaksi Seura julkaisi myös ensimmäiset kotisivunsa tässä osoitteessa 1999. Sivut uusittiin syksyllä 2003."
    },
    {
        "teksti": "Vuodesta 2005 seuraa on johtanut Jaana Toivari-Viitala. Seuran 40-vuotisjuhlanäyttely järjestettiin kesällä 2009 Loviisan Kaupungin museossa."
    }
]
